Revit 2026 API

# IFCExportOptions Methods

---

The IFCExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddOption | Adds a new named option to the options structure. |
|  | Assign | Assigns the values of the IFCExportOptions to this options object. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

IFCExportOptions Class

Autodesk.Revit.DB Namespace